src/tr069/samples/tr069_transfer_complete_req.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Header>
   <cwmp:ID soapenv:mustUnderstand="1">0</cwmp:ID>
 </soapenv:Header>
   <soapenv:Body>
       <cwmp:TransferComplete>
           <CommandKey>TransferCompleteCommandKey</CommandKey>
           <cwmp:FaultStruct>
               <FaultCode>0</FaultCode>
               <FaultString></FaultString>
           </cwmp:FaultStruct>
           <StartTime>2011-08-04t13:15:59.137Z</StartTime>                      
           <CompleteTime>2011-08-04T13:15:59.137Z</CompleteTime>                                                      
       </cwmp:TransferComplete>
   </soapenv:Body>
 </soapenv:Envelope>
